
/*
	for文(その２)

	・要点
	for文を使えば配列変数を一括して処理できる。

	<出力結果>
	クラスの平均点は 542.875 点です。
*/

#include <iostream>
using namespace std;

int score[] = {
	641, 703, 405, 598, 402, 752, 330, 0, 445, 662,
	254, 710, 467, 530, 548, 485, 244, 396, 601, 510,
	532, 687, 623, 420, 647, 587, 490, 647, 575, 688,
	764, 633, 712, 312, 655, 425, 722, 631, 680, 602,
};

int main()
{
	int sum = 0;

	for (int i = 0; i < 40; ++i)
	{
		sum += score[i];
	}

	cout << "クラスの平均点は " << sum / 40.0 << "点です。" << endl;

	getchar();
	return 0;
}
